<?php
return array(
	//'配置项'=>'配置值'
    'ADMIN_LOG_TYPE'    =>  [1 => '登录', 2 => '修改', 3 => '添加', 4 => '删除'], // 管理员日志类型
    'PLATFORM'          =>  [1 => 'WIN', 2 => 'Android', 3 => 'IOS', 4 => 'MACOS'],    // 平台
    'PAYMENT_TYPE'      =>  [1 => '支付宝', 2 => 'QQ钱包', 3 => '微信', 4 => '银联快捷', 5 => '支付宝扫码', 6 => 'QQ扫码', 7 => '微信扫码', 8 => '支付宝定额', 9 => '微信定额', '10' => '点卡', 11 => '扫码支付'],   // 支付类型
    'PAYORDER_STATE'    =>  [0 => '失败', 1 => '支付成功', 2 => '发货成功', 3 => '新订单'],
    'TX_TYPE'           =>  [1 => '银行卡', 2 => '支付宝'],  // 提现类型
    'TX_CLASS'          =>  [1 => '普通提现', 2 => '推广员提现'],  // 提现分类
    'HTSH_RES'          =>  [0 => '', 1 => '通过', 2 => '不通过'],  // 后台审核结果
    'TDTX_RES'          =>  [0 => '', 1 => '成功', 2 => '失败', 3 => '无可用提现通道'],  // 提现通道结果
    'RGCL_RES'          =>  [0 => '', 1 => '已打款', 2 => '退币'],  // 人工处理结果
    'DD_STATE'          =>  [1 => '审核中', 2 => '已拒绝', 3 => '通道提现中', 4 => '人工处理中', 5 => '已打款', 6 => '已退币'],  // 订单状态
    'TXDD_STATE'        =>  [2 => '已拒绝', 5 => '已打款', 6 => '已退币'],  // 提现记录-订单状态
    'ROOM'              =>  [1 => '平民', 2 => '小资', 3 => '老板', 4 => '土豪'],  // 房间类型
    'ROOM_'             =>  [1 => '初级', 2 => '中级', 3 => '高级'], // 房间类型
    'SSC'               =>  [1 => '散牌', 2 => '对子', 3 => '顺子', 4 => '金花', 5 => '顺金', 6 => '豹子'],    // 时时彩开牌结果
    'BCBM_RESULT'       =>  [1 => '法拉利', 2 => '兰博基尼', 3 => '玛莎拉蒂', 4 => '保时捷', 5 => '奔驰', 6 => '宝马', 7 => '本田', 8 => '大众'],  // 奔驰宝马开奖结果
    'YUEBAO_TYPE'       =>  [4 => '活期', 1 => '7日定存', 2 => '15日定存', 3 => '30日定存'],  // 余额宝类型









    'YUEBAO_VARY'       =>  [
        107 => '余额宝取出',
        108 => '余额宝存入',
        109 => '余额宝活期结算',
        110 => '购买7日定存金额',
        111 => '购买15日定存金额',
        112 => '购买30日定存金额',
        113 => '卖出7日定存本金',
        114 => '卖出15日定存本金',
        115 => '卖出30日定存本金',
        116 => '卖出7日定存利息',
        117 => '卖出15日定存利息',
        118 => '卖出30日定存利息',
        119 => '7日定存正常结算本金',
        120 => '15日定存正常结算本金',
        121 => '30日定存正常结算本金',
        122 => '7日定存正常结算利息',
        123 => '15日定存结算利息',
        124 => '30日定存结算利息',
    ],
    'GAMES'             =>  [
        1 => '大厅',
        2 => '百人金花',
        3 => '龙虎斗',
        4 => '百家乐',
        5 => '时时彩',
        6 => '奔驰宝马',
        7 => '幸运转盘',
        8 => '炸金花',
        9 => '牛牛',
        10 => '红包接龙',
        11 => '推筒子',
        //12 => '麻将',
        13 => '跑得快',
    ],
    'OPERATE'           =>  [
        0 => ' 补发订单',
        1 => ' 充值RMB',
        2 => '百人金花和局退钱',
        3 => '百人金花下注',
        4 => '百人金花结算',
        5 => '百人金花庄家结算',
        6 => '百人金花异常返还',
        7 => '金花下注',
        8 => '金花结算',
        9 => '牛牛结算',
        10 => '推筒子结算',
        11 => '红包接龙发红包',
        12 => '红包接龙结算',
        13 => '麻将抽水',
        14 => '麻将杠',
        15 => '麻将胡',
        16 => '麻将花猪',
        17 => '麻将查叫',
        18 => '麻将退税',
        19 => '龙虎斗下注',
        20 => '龙虎斗结算',
        21 => '龙虎斗庄家结算',
        23 => '百家乐下注',
        24 => '百家乐结算',
        26 => '跑得快结算',
        27 => '跑得快炸弹',
        31 => '时时彩下注',
        32 => '时时彩结算',
        33 => '奔驰宝马下注',
        34 => '奔驰宝马结算',
        35 => '奔驰宝马庄家赢钱',
        36 => '奔驰宝马庄家赔钱',
        37 => ' 转盘消耗',
        38 => '转盘得到',
        51 => '茶馆馆主抽成',
        52 => '代理抽成',
        53 => '提现扣除',
        54 => '充值返利',
        55 => '提现退币',
        61 => 'EMail赠送',
        62 => '后台发放',
        63 => '后台回收',
        64 => '后台邮件金币',
        65 => '代理给玩家充值扣除',
        66 => '玩家通过代理充值获得',
        67 => '官方扫码',
        72 => '话费兑换',
        74 => '注册奖励',
        75 => '绑定手机奖励',
        76 => '老玩家回归绑定',
        77 => '分享获得金币',
        81 => '马甲包金币变化',
        91 => '奔驰宝马押注金币退还',
        92 => '百家乐押注金币退还',
        93 => '百人金花押注金币退还',
        94 => '红包押注金币退还',
        95 => '金花押注金币退还',
        96 => '龙虎斗押注金币退还',
        97 => '牛牛押注金币退还',
        98 => '跑得快押注金币退还',
        99 => '时时彩押注金币退还',
        100 => '筒子押注金币退还',
        101 => '转盘押注金币退还',
        102 => '存入余额宝',
        103 => '从余额宝转出',
        104 => '余额宝购买产品',
        105 => '余额宝卖出产品',
        106 => '余额宝定存',

        //余额宝明细 107-124
        107 => '余额宝取出',
        108 => '余额宝存入',
        109 => '余额宝活期结算',
        110 => '购买7日定存金额',
        111 => '购买15日定存金额',
        112 => '购买30日定存金额',
        113 => '卖出7日定存本金',
        114 => '卖出15日定存本金',
        115 => '卖出30日定存本金',
        116 => '卖出7日定存利息',
        117 => '卖出15日定存利息',
        118 => '卖出30日定存利息',
        119 => '7日定存正常结算本金',
        120 => '15日定存正常结算本金',
        121 => '30日定存正常结算本金',
        122 => '7日定存正常结算利息',
        123 => '15日定存结算利息',
        124 => '30日定存结算利息',

        201 => '进入奔驰宝马',
        202 => '离开奔驰宝马',
        203 => '进入百家乐',
        204 => '离开百家乐',
        205 => '进入百人金花',
        206 => '离开百人金花',
        207 => '进入红包接龙',
        208 => '离开红包接龙',
        209 => '进入金花',
        210 => '离开金花',
        211 => '进入龙虎斗',
        212 => '离开龙虎斗',
        213 => '进入牛牛',
        214 => '离开牛牛',
        215 => '进入跑得快',
        216 => '离开跑得快',
        217 => '进入时时彩',
        218 => '离开时时彩',
        219 => '进入推筒子',
        220 => '离开推筒子',
        221 => '进入幸运转盘',
        222 => '离开幸运转盘',
    ],
    'OPERATE_TYPE'     =>  [
        1 => '充值',
        2 => '提现',
        3 => '后台',
        4 => '邮件',
        5 => '佣金',
        6 => '余额宝',
        7 => '跑得快',
        8 => '抢庄牛牛',
        9 => '炸金花',
        10 => '推筒子',
        11 => '红包接龙',
        12 => '红黑大战',
        13 => '龙虎斗',
        14 => '百家乐',
        15 => '疯狂三张',
        16 => '奔驰宝马',
        17 => '百人牛牛',
        100 => '其他',
    ],



    'CELL_NAME'        =>  [ // 导出Excel

    ],
);